УТ/src/Catalogs/CRM_ВысокочастотныеФИО/CRM_ВысокочастотныеФИО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВысокочастотныеФИО</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ВысокочастотныеФИО/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		ЭтоФамилия  = Объект.Фамилия;
		ЭтоИмя		= Объект.Имя;
		ЭтоОтчество = Объект.Отчество;
		
		Если ЭтоФамилия Тогда
			ПереключательФИО = "Фамилия";
		ИначеЕсли ЭтоИмя Тогда
			ПереключательФИО = "Имя";
		Иначе
			ПереключательФИО = "Отчество";	
		КонецЕсли;
		
	Иначе
		ПереключательФИО = "Фамилия";
		ЭтоФамилия = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Фамилия = ЭтоФамилия;
	Объект.Имя = ЭтоИмя;
	Объект.Отчество = ЭтоОтчество;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПереключательФИОПриИзменении(Элемент)
	
	ЭтоФамилия  = Ложь;
	ЭтоИмя		= Ложь;
	ЭтоОтчество = Ложь;
	
	Если ПереключательФИО = "Фамилия" Тогда
		ЭтоФамилия  = Истина;
	ИначеЕсли ПереключательФИО = "Имя" Тогда
		ЭтоИмя  = Истина;
	Иначе
		ЭтоОтчество = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы
